Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: འཇིག་རྟེན་གྲགས་པའི་བླ་མ་ལ། རིམ་གྲོ་དག་ནི་རབ་བྱ་སྟེ། ། སྙིང་པོ་མེད་པའི་ལུས་ལས་སུ། །སྙིང་པོ་དག་ནི་བླང་བར་འགྱུར། །
en: “I will show reverence To those in this world who are esteemed gurus And put this insubstantial body To good use.

source: ཤཱ་རིའི་བུ་སེམས་བསྐྱེད་པ་དང་པོ་འདི་བསྐྱེད་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཡོངས་སུ་ཚོལ་བས་སློབ་དཔོན་ལ་རིམ་གྲོ་དང་། བསྙེན་བཀུར་བྱེད་དེ། ཐ་ན་ཆུ་རྫ་གང་ཙམ་ཡང་འབུལ་ལོ། །
en: “This then, Śāriputra, is the first thought the bodhisatva cultivates, and so he applies himself to the cycle of teachings contained in The Collected Teachings on the Bodhisatva, honoring and serving his teacher to the extent that he would even be willing to give up his water flask.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟར་སེམས་བསྐྱེད་དེ། ཀྱེ་མའོ་ལུས་འདི་ནི་སྙིང་པོ་མེད་པ་སྟེ། རྟག་ཏུ་དྲིལ་བ་དང་། བཀྲུ་བ་དང་། མཉེ་བ་དང་། འཇིག་པ་དང་། འགྱེས་པ་དང་། འབྲལ་བའི་ཆོས་ཅན་ནོ། །
en: “Furthermore, Śāriputra, the bodhisatva cultivates the following thought: ‘How insubstantial this body is! It is constantly becoming dilapidated, threadbare, and worn out, getting broken or crushed, decaying, and being destroyed.’

source: ཤཱ་རིའི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ཇི་ཙམ་དུ་རྫ་མཁན་གྱིས་བུམ་པ་ཆུང་ཚད་དང་། ཆེ་ཚད་བྱས་པ་ཐམས་ཅད་ཀྱང་མཐར་འཇིག་གོ ། དེ་བཞིན་དུ་ཀྱེ་མའོ་ལུས་འདི་ཡང་སྙིང་པོ་མེད་པ་སོ་མ་བཏང་བའི་སྣོད་བཞིན་ཏེ། མཐར་འཇིག་པའོ ། ཤཱ་རིའི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ཤིང་གི་ཡལ་གའི་འདབ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་ཇི་སྙེད་པ་དེ་ཐམས་ཅད་ཀྱང་མཐར་ལྟུང་བར་འགྱུར་རོ། ། ཤཱ་རིའི་བུ་དེ་བཞིན་དུ་ཀྱེ་མའོ་ལུས་འདི་ནི་སྙིང་པོ་མེད་དེ། འབྲས་བུ་སྨིན་པ་བཞིན་དུ་ལྟུང་བའི་ཆོས་ཅན་ནོ། ། ཤཱ་རིའི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་རྩྭའི་རྩེ་མོའི་ཟིལབའི་ཐིགས་པ་ཇི་སྙེད་པ་དེ་ཐམས་ཅད་ཀྱང་ཉི་མས་ཕོག་ན་རིང་པོར་མི་གནས་སོ། ། ཤཱ་རིའི་བུ་དེ་བཞིན་དུ་ཀྱེ་མའོ་ལུས་འདི་ནི་སྙིང་པོ་མེད་པ་སྟེ། ཟིལ་པའི་ཐིགས་པ་བཞིན་དུ་རིང་པོར་མི་གནས་པའོ། ། ཤཱ་རིའི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་རྒྱ་མཚོ་ཆེན་པོ་དང་། འབབ་ཆུ་དང་། འབབ་ཆུའི་རྒྱུན་ལ་དབུ་བ་རྡོས་པ་ཡོད་པ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་སྙིང་པོ་མེད་དེ་རང་བཞིན་གྱིས་ཉམ་ཆུང་བའོ། ། ཤཱ་རིའི་བུ་དེ་བཞིན་དུ་ཀྱེ་མའོ་ལུས་འདི་ནི་སྙིང་པོ་མེད་པ་སྟེ། དབུ་བ་རྡོས་པ་ལྟར་རང་བཞིན་གྱིས་ཉམ་ཆུང་བའོ། ། ཤ་རིའི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ཆར་བབ་པའི་ཆུའི་ཆུ་བུར་གཞན་སྐྱེ་ཞིང་གཞན་འགག་གོ ། ཤཱ་རིའི་བུ་དེ་བཞིན་དུ་ཀྱེ་མའོ་ལུས་འདི་ནི་སྙིང་པོ་མེད་པ་སྟེ། ཆུའི་ཆུ་བུར་ལྟར་རང་བཞིན་གྱིས་ཉམ་ཆུང་བའོ། །
en: “Śāriputra, however many pots, large or small, a potter makes, they will all eventually break. In the same way, Śāriputra, this insubstantial body will eventually break. It will break as easily as an unfired pot. Śāriputra, however many leaves, flowers, and fruits may hang on the branches of a tree, they will all eventually fall to the ground. In the same way Śāriputra, this insubstantial body is ready to fall to the ground like ripe fruit. Śāriputra, however many dewdrops hang on the tips of blades of grass, none of them will last very long; they will vanish when the sunlight hits them. In the same way Śāriputra, just like a dewdrop this insubstantial body will not last long. Śāriputra, however much froth may accumulate on the oceans, in rivers, and in streams, it has no substance and is by nature fragile. So it is, Śāriputra, with this insubstantial body. It is by nature fragile, just like froth. Śāriputra, just as raindrops in the sky appear and vanish one after the other, this body, Śāriputra, is insubstantial and fragile by nature, like a raindrop. ‘Therefore, I will put this insubstantial body to good use.’

source: དེ་ལྟར་སྙིང་པོ་མེད་པའི་ལུས་ལས་སྙིང་པོ་བླང་ངོ་སྙམ་དུ་སེམས་བསྐྱེད་པ་གཉིས་པ་དེ་བསྐྱེད་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཡོངས་སུ་ཚོལ་བས་སློབ་དཔོན་ལ་རིམ་གྲོ་དང་བསྙེན་བཀུར་བྱེད་དོ། །
en: “This is the second thought the bodhisatva cultivates, and so he applies himself to the cycle of teachings contained in The Collected Teachings on the Bodhisatva, honoring and serving his teacher to the extent that he would even be willing to give up his water flask.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དོན་དེ་ཉིད་རྒྱ་ཆེར་རབ་ཏུ་བསྟན་པའི་ཕྱིར། དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །
en: Then, in order to clarify this point further, the Lord went on to speak these verses:

source: ཇི་ལྟར་རྫ་མའི་མཁན་པོ་ཡིས། །སལས་སྣོད་རྣམས་བྱས་པ་དག ། དེ་དག་ཐམས་ཅད་མཐར་འཇིག་སྟེ། །
en: “A potter makes pots Out of clay That will all eventually break.

source: སེམས་ཅན་སྲོག་ཀྱང་དེ་དང་འདྲ། །
en: The lives of sentient beings are like this.

source: ཇི་ལྟར་ཤིང་གི་ཡལ་ག་ཡི། །ལོ་མ་མེ་ཏོག་འབྲས་བུ་རྣམས། །ཐམས་ཅད་ལྟུང་བའི་ཆོས་ཅན་ཏེ། །མི་ཡི་སྲོག་ཀྱང་དེ་བཞིན་ནོ། །
en: “Leaves, flowers, and fruit Hanging on the branches of a tree Will all find themselves falling to the ground. The lives of mortals are like this.

source: རྩྭ་མཆོག་དག་གི་ཟིལ་པའི་ཐིགས། །ཉི་མས་ཡོངས་སུ་བབ་པ་ན། ཡིད་ཙམ་གྱིས་ནི་མེད་འགྱུར་ཏེ། །
en: “Dewdrops on the tips of blades of grass Will be no more The instant sunlight hits them.

source: མི་ཡི་སྲོག་ཀྱང་དེ་བཞིན་ནོ། །
en: The lives of mortals are like this.

source: ཇི་ལྟར་འབབ་ཆུའི་རྒྱུན་རྣམས་ཀྱི། །དབུ་བ་རྡོས་པ་ཉམ་ཆུང་ལྟར། །དེ་ལྟར་ལུས་ནི་ཉམ་ཆུང་སྟེ། །སྙིང་པོ་མེད་པ་དབུ་བ་འདྲ། །
en: “Just like fragile froth Accumulating in rivers and streams, The body is extremely fragile, Insubstantial, like froth.

source: ཇི་ལྟར་ཆར་པ་བབ་པ་ཡི། །ཆུ་ཡི་ཆུ་བུར་སྐྱེས་པ་ཡང་། །སྐད་ཅིག་གིས་ནི་དེ་འཇིག་འགྱུར། །དེ་བཞིན་ལུས་ཀྱང་སྙིང་པོ་མེད། །
en: “Just as raindrops Appear in the sky And disappear again just as quickly, So, too, is this body insubstantial.

source: སྙིང་པོ་མ་ཡིན་སྙིང་པོར་ཤེས། །
en: “Those who conceive of the insubstantial as substantial

source: སྙིང་པོ་སྙིང་པོ་མ་ཡིན་འཛིན། །
en: And conceive of the substantial as insubstantial

source: དེ་དག་ལོག་རྟོག་སྤྱོད་ཡུལ་ཏེ། །སྙིང་པོ་ཁོང་དུ་ཆུད་མ་ཡིན། །
en: Do not realize what is substantial And remain stuck in the sphere of mistaken ideas.

source: སྙིང་པོ་མེད་ལ་སྙིང་མེད་པ། །སྙིང་པོ་སྙིང་པོར་ཤེས་པ་ནི། །དེ་དག་ཡང་དག་རྟོག་པའི་ཡུལ། །སྙིང་པོ་ཁོང་དུ་ཆུད་པ་ཡིན། །
en: “Those who understand that the substantial is substantial And that the insubstantial is insubstantial Will realize what is substantial And remain within the sphere of correct ideas.

source: སྙིང་པོ་འདུ་ཤེས་བྱས་གྱུར་ཏེ། །
en: “In order to find out what is substantial,

source: རྫ་གང་ཙམ་གྱི་ཆུ་འབུལ་བ། །སྙིང་པོ་མེད་པའི་ལུས་ལས་ནི། །སྙིང་པོ་དག་ནི་ལེན་པར་འགྱུར། །
en: I will even give up my water flask. Thinking in this way, he makes good use Of his insubstantial body.

source: ཤཱ་རིའི་བུ་སེམས་བསྐྱེད་པ་གཉིས་པ་འདི་བསྐྱེད་ནས་ བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཡོངས་སུ་ཚོལ་བས་སློབ་དཔོན་ལ་རིམ་གྲོ་དང་། བསྙེན་བཀུར་བྱེད་དེ ཐ་ན་ཆུ་ཕོར་གང་ཙམ་ཡང་འབུལ་ལོ། །
en: “This, then, Śāriputra, is the second thought the bodhisatva cultivates, and so he applies himself to the cycle of teachings contained in The Collected Teachings on the Bodhisatva, honoring and serving his teacher to the extent that he would even be willing to give up his water flask.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟར་སེམས་བསྐྱེད་དེ། བདག་ཡུན་རིང་པོར་དགེ་བའི་བཤེས་གཉེན་དང་བྲལ་ཞིང་མི་དགེ་བའི་བཤེས་གཉེན་གྱི་དབང་དུ་སོང་སྟེ། ལེ་ལོ་ཅན། བརྩོན་འགྲུས་ཉམས་པ། སྙོམ་ལས་ཅན། བླུན་པ། ལོག་པར་ལྟ་བ་སྟེ། མཆོད་སྦྱིན་ཡང་མེད། སྦྱིན་སྲེག་ཀྱང་མེད། ལེགས་བྱས་དང་། ཉེས་བྱས་ཀྱི་ལས་རྣམས་བྱས་པའི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་བསགས་པ་ཡང་མེད་པར་ལྟ་བ་དང་། འདོད་པའི་ཟིལ་གྱིས་ནོན་ཏེ། བདག་གིས་མི་དགེ་བའི་ལས་མང་པོ་མངོན་པར་འདུས་བྱས་ཏེ། མི་དགེ་བའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་དེས་འདི་ལྟ་སྟེ། ཡི་དགས་ཀྱི་ཡུལ་དུ་སྦྱིན་གནས་ཐམས་ཅད་གསོབ་མ་ཡིན་པ་འཇིགས་སུ་རུང་བའི་ལུས་ཐོབ་སྟེ། འདི་ལྟ་བུའི་སྦྱིན་གནས་མཉེས་པར་མ་བྱས་པས་དེ་ནི་བདག་ཡི་དགས་སུ་གྱུར་ཏེ། ལོ་མང་པོ། ལོ་སྟོང་ཕྲག་མང་པོ། ལོ་བརྒྱ་སྟོང་ཕྲག་མང་པོར་མེ་མ་མུར་ཟ་ཞིང་ཆུའི་སྒྲ་ཡང་མི་ཐོས་ན། ལུས་ཀྱི་ལྟ་ག་ལ་ཞིག་རེག་སྟེ། བདག་གིས་ནི་ད་ལྟར་མཉེས་པར་བྱས་པས་བདག་དགེ་བའི་ལུས་ཐོབ་ཀྱིས་སྦྱིན་གནས་ཐམས་ཅད་ཀྱི་ཉེ་བར་འཚོ་བར་བྱ་ཞིང་། ལུས་དང་སྲོག་ལ་མི་ལྟ་བར་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཡོངས་སུ་བཙལ་བའི་ཕྱིར་སློབ་དཔོན་ལ་རིམ་གྲོ་བྱའོ་སྙམ་དུ་སེམས་བསྐྱེད་པ་གསུམ་པ་འདི་དག་བསྐྱེད་ནས་བྱང་ཆུབ་སེམས་དཔའ་སློབ་དཔོན་ལ་རིམ་གྲོ་དང་། བསྙེན་བཀུར་བྱེད་དེ། ཐ་ན་ཆུ་རྫ་གང་ཙམ་ཡང་འབུལ་ལོ། །
en: “Furthermore, Śāriputra, the bodhisatva cultivates the following thought: ‘For a long time I had no spiritual friends. Influenced by evil friends, I was lazy, I had little vigor, I was idle and stupid and held wrong views, and so I did not pay proper attention to making offerings and sacrifices and performing the fire ritual. I thought that there would be no consequences to the good and bad actions I carried out, and I was overcome by temptations. In this way I developed many bad habits, and as a result of these unwholesome habits I had to endure terrible states of existence. In the preta realm I was not able to rely on those who are worthy of veneration. As a preta I had charcoal for sustenance, and for many years, many hundreds of years, many thousands of years, many hundreds of thousands of years, I did not even hear the word water, much less come in contact with it. In this kind of state, I had no inclination to serve those who are worthy of veneration. Now that I have attained this fortunate state and my motivation is good, I will dedicate my life to those who are worthy of veneration. I will honor the teachers and apply myself to the cycle of teachings contained in The Collected Teachings on the Bodhisatva, with no concern for my body or my life.’ “This is the third thought the bodhisatva cultivates, and so he honors and serves his teacher to the extent that he will even be willing to give up his water flask.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །
en: The Lord then spoke these verses:

source: ཇི་ལྟར་གྲོགས་པོ་བསྟེན་པ་དང་། །ཇི་ལྟར་ཉེ་བར་བསྟེན་པ་ལྟར། །དེ་དག་ཡང་དང་ཡང་བསྙེན་པས། །དེ་ཡང་དེ་དང་འདྲ་བར་འགྱུར། །
en: “A friend to whom you are devoted Is someone that you serve. By serving someone again and again, You will become like them.

source: སྡིག་པའི་གྲོགས་པོའི་དབང་སོང་ནས། །
en: “Influenced by evil friends,

source: དགེ་བའི་བཤེས་གཉེན་རྣམ་པར་སྤངས། །
en: I abandon friends who bring me benefit,

source: ལེ་ལོ་ཆེ་ཞིང་བརྩོན་འགྲུས་ཉམས། །གཡོ་དང་ཕྲག་དོག་སེར་སྣ་ཅན། །
en: And I become lazy, with little vigor, Envious, jealous, and false.

source: བྱིས་པ་ཡོད་པར་གང་ལྟ་བ། །ཐམས་ཅད་དུ་ནི་རྣམ་སྤངས་པས། །བདག་ནི་ཡི་དགས་སྐྱེ་གནས་སུ། །འཇིགས་སུ་རུང་བའི་ལུས་ཐོབ་བོ། །
en: “Things such as generosity Have been abandoned completely, And I will certainly end up In a terrible state of existence as a preta.

source: ཡུན་རིང་དུས་སུ་འཁོར་བ་ཡི། །མུན་ནག་ཕུང་པོ་འཇིགས་པ་ན།
en: “For a long time I will find myself In a dreadful, shadowy cycle.

source: བཀྲེས་པ་དང་ནི་སྐོམ་པས་གཟིར། །
en: Seized by hunger and thirst,

source: སྡུག་བསྔལ་མང་པོ་རྗེས་སུ་མྱོང་། །
en: I will suffer incredible pain.

source: སྦྱིན་གནས་རྣམས་ནི་མ་མཐོང་ཞིང་། །བདག་གིས་འདི་འདྲ་དལ་མ་ཐོབ། ། ལོ་ནི་མང་པོ་སྟོང་རྣམས་སུ། །ཆུ་ཡི་སྒྲ་ཡང་ཡོང་མ་ཐོས། །
en: “For a great many thousands of years I will not even hear the word water, And, having no regard for those who are worthy of veneration, I will not encounter any opportunities to develop.

source: ད་ལྟར་བདག་གིས་འཇིག་རྟེན་ན། །
en: “The situation in which I now find myself

source: ཤིན་ཏུ་དཀོན་པ་རབ་རྙེད་དེ། །
en: Is something that is very difficult to attain.

source: བདག་གིས་སློབ་དཔོན་མཉེས་བྱས་པས། །དལ་བ་འབྱོར་པ་བདག་གིས་ཐོབ། །
en: It is through having served my teacher That I have obtained this fortunate opportunity.

source: སྡིག་པའི་གྲོགས་པོ་རྣམ་སྤངས་པས། །བདག་གིས་དགེ་བའི་བཤེས་གཉེན་རྙེད། །
en: “I have abandoned evil friends. I have met with virtuous friends,

source: བྱང་ཆུབ་ཐོབ་པར་བྱ་བའི་ཕྱིར། །ལུས་དང་སྲོག་ལ་མི་བལྟའོ། །
en: And so with no concern for my body or my life, I will work toward awakening.

source: སངས་རྒྱས་ཀྱི་ནི་བྱང་ཆུབ་ཕྱིར། །སློབ་དཔོན་བླ་མ་མཆོད་གནས་ལ། །རྣམ་པར་དད་པའི་སེམས་ཀྱིས་སུ། །བསྟི་སྟང་གུས་པར་རབ་ཏུ་བྱ། །
en: “Filled with faith in the teachers, The gurus, those who are worthy of honor, I will honor them and praise them In order to realize awakening.

source: ཤཱ་རིའི་བུ་སེམས་བསྐྱེད་པ་གསུམ་པ་འདི་བསྐྱེད་ནས་ བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཡོངས་སུ་ཚོལ་བས་སློབ་དཔོན་ལ་རིམ་གྲོ་དང་། བསྙེན་བཀུར་བྱེད་དེ ཐ་ན་ཆུ་ཕོར་གང་ཙམ་ཡང་འབུལ་ལོ། །
en: “This then, Śāriputra, is the third thought the bodhisatva cultivates, and so he applies himself to the cycle of teachings contained in The Collected Teachings on the Bodhisatva, honoring and serving his teacher to the extent that he would even be willing to give up his water flask.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟར་སེམས་བསྐྱེད་དེ། བདག་ཡུན་རིང་པོར་དགེ་བའི་བཤེས་གཉེན་དང་བྲལ་ཞིང་སྡིག་པའི་གྲོགས་པོས་ཟིན་པས་ལེ་ལོ་ཅན། བརྩོན་འགྲུས་ཉམས་པ། སྙོམ་ལས་ཅན། བླུན་པས་སེམས་ཅན་ལ་ཁུ་ཚུར་དང་། ཐལ་མོས་བརྡེགས་ཤིང་གཙེས་ནས་ བསྡུས་ཤིང་ཆོ་ངེ་བཏོན་ཏེ། དེའི་གཞི་ལས་སྡིག་པ་ཡང་མེད། དེའི་གཞི་ལས་སྡིག་པ་འབྱུང་བ་ཡང་མེད་དོ། ། ཞེས་དེ་ལྟར་ལྟ་བ་དང་། དེ་ལྟར་བཟོད་པ་དང་། དེ་ལྟར་མོས་ཤིང་ཞེ་སྡང་གི་ཟིལ་གྱིས་ནོན་པས་མི་དགེ་བའི་ལས་རྣམས་མངོན་པར་འདུས་བྱས་ཏེ། མི་དགེ་བའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་དེས་འདི་ལྟ་སྟེ་དུད་འགྲོའི་སྐྱེ་གནས་སུ། སྦྱིན་གནས་ཐམས་ཅད་ཉེ་བར་འཚོ་བ་མ་ཡིན་པ། འཇིགས་སུ་རུང་བའི་ལུས་ཐོབ་སྟེ། འདི་ལྟ་བུའི་སྦྱིན་གནས་མགུ་བར་མ་བྱས་པས། དེས་ན་བདག་རྔ་མོ་དང་། བ་ལང་དང་། བོང་བུར་གྱུར་ཏེ། རྩྭ་ཟ་ཞིང་དབྱིག་པས་བསྡིགས། འཇིགས་པས་བསྡིགས་ནས། མི་འདོད་བཞིན་དུ་ཁལ་བཀལ་ཏོ། ། བདག་གིས་ནི་ད་ལྟར་མཉེས་པར་བྱས་ཏེ། དགེ་བའི་ལུས་ཐོབ་ཀྱིས་ལུས་དང་སྲོག་ལ་མི་བལྟ་བར་སློབ་དཔོན་ལ་ནི་རིམ་གྲོ་དང་། བསྙེན་བཀུར་བྱའོ་ཞེས། ཤཱ་རིའི་བུ་སེམས་བསྐྱེད་པ་བཞི་པ་དེ་བསྐྱེད་ནས་ བྱང་ཆུབ་སེམས་དཔའ་སློབ་དཔོན་ལ་རིམ་གྲོ་དང་བསྙེན་བཀུར་བྱེད་དེ ཐ་ན་ཆུ་བུམ་པ་གང་ཙམ་ཡང་འབུལ་ལོ། །
en: “Furthermore, Śāriputra, the bodhisatva cultivates the following thought: ‘For a long time I had no spiritual friends. Surrounded by evil friends, I was lazy, I had little vigor, I was idle and stupid, and I had the sort of opinions, the sort of tendencies, and the sort of convictions that led me to believe that it would not be evil, and that there would be no evil consequences, if I injured sentient beings, if I left them crying and wailing as I slapped and beat them, completely enveloped by anger. In this way I developed many bad habits, and as a result of these unwholesome habits I had to endure terrible states of existence. In the realm of animals I was not able to rely upon those who are worthy of veneration, and as a camel, a cow, or a donkey I had to live on grass, be beaten with sticks, suffer fear, work against my will, and be used as a pack animal. In this kind of state I had no inclination to serve those who are worthy of veneration. Now that I have attained this fortunate state, and now that my motivation is good, I will honor the teachers and apply myself to the cycle of teachings contained in The Collected Teachings on the Bodhisatva, with no concern for my body or my life.’ “This is the fourth thought the bodhisatva cultivates, and so he honors and serves his teacher to the extent that he will even be willing to give up his water flask.”

source: འདིའི་ཆོས་ཉིད་ནི་འདི་ཡིན་ཏེ། དེ་ལ་འདི་སྐད་ཅེས་བྱའོ། །
en: This is the way things are, and concerning it the following verses were recited:

source: ཡུན་རིང་པོར་ནི་འཕགས་པའི་ལམ། །མ་རིག་པར་ནི་གནས་པས་ན། །
en: “For a long time, Being ignorant of the noble path,

source: རྔ་མོ་དག་དང་བོང་བུར་གྱུར། ། སྡུག་བསྔལ་མང་པོ་རྗེས་སུ་མྱོང་། །
en: One ends up as a camel or an ass And has to undergo great suffering.

source: མིར་གྱུར་པ་ཡང་བདག་གིས་རྙེད། ། གང་གིས་བྱང་ཆུབ་རེག་འགྱུར་བའི། །བཟང་པོ་ཡི་ནི་ལས་བྱ་སྟེ། །དེ་ནི་མཁས་པའི་མཚན་ཉིད་དོ། །
en: “As I have gained a human state, I will act in a virtuous way In order to attain awakening—This is the way of the wise.

source: སངས་རྒྱས་ཆོས་ལ་རབ་གནས་ཤིང་། །གུས་པ་དང་ནི་ལྡན་པར་བྱ། །
en: “I will apply myself with devotion To the teachings of the Buddha,

source: བྱང་ཆུབ་ཕྱིར་ནི་སློབ་དཔོན་ལ། །རིམ་གྲོ་དང་ནི་བསྟི་སྟང་བྱ། །
en: And in order to reach awakening I will honor and serve the teachers.

source: འདས་པའི་དུས་ཀྱི་བསྐལ་པ་བསམ་མེད་ནས། །
en: “For inconceivable eons in the past,

source: འཁོར་བའི་འཁོར་ལོར་ཡོངས་སུ་འཁྱམས་པ་ན། །
en: I have wandered cyclic existence,

source: སྐྱེ་མཆེད་དག་ནི་དོན་མེད་འདས་གྱུར་ཏེ། །
en: Using my senses in pointless ways,

source: སྦྱིན་གནས་དག་ནི་ཉེ་བར་འཚོ་བ་མིན། །
en: And I did not seek out those who are worthy of veneration.

source: དགེ་བའི་བཤེས་གཉེན་ཡོངས་སུ་སྤངས་གྱུར་ནས། །
en: “I abandoned spiritual friends

source: རྟག་ཏུ་སྡིག་པའི་གྲོགས་པོ་རབ་བསྟེན་ཏེ། །
en: And constantly relied on evil friends.

source: དེ་དག་གིས་ནི་བསྟན་པའི་རྗེས་འཇུག་ཅིང་། །རྒྱུན་མི་འཆད་པར་ངན་སོང་ས་ལ་གནས། །
en: Following their teachings, I have had to endure states of misfortune again and again.

source: གཙེ་བ་དང་ནི་བཅིང་ཞིང་བརྡེག་པ་རྣམས། །བྱེད་དུ་བཅུག་ཅིང་གཞན་ལ་སྤྱོས་བྱས་ནས། ། དེ་ཡི་འབྲས་བུ་ངན་སོང་སྐྱེ་གནས་འགྲོ། ། སྡིག་པའི་ལས་ཀྱིས་སྡུག་བསྔལ་རྗེས་སུ་མྱོང་། །
en: “I have been responsible for trapping, enslaving, beating, And killing. As a result of this, I have been born in the animal realm And undergone the suffering brought about by my harmful actions.

source: དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་མ་བསྟེན་པས། །རྔ་མོ་བ་ལང་དེ་བཞིན་བོང་བུ་ཡི། །ངན་པའི་མཚམས་ཀྱི་སྐྱེ་མཆེད་བཟུང་གྱུར་ནས། །
en: “Having ended up in unfortunate states of existence, As a camel, a cow, or an ass, I have been beaten with sticks and put to work, Without the opportunity to rely on spiritual friends.

source: དབྱུག་པ་དག་གིས་བརྡེགས་ཤིང་ཁལ་ཀྱང་བཀལ། །མིར་འགྱུར་བ་ནི་ཤིན་ཏུ་རྙེད་དཀའ་དང་། །འཐུན་པའི་ཡུལ་དང་དགེ་བའི་བཤེས་གཉེན་རྙེད། །
en: “I have attained something very rare, a human state. I have met with spiritual guides, and I am in an ideal place.

source: ཤིན་ཏུ་ཡུན་རིང་དལ་བ་རྙེད་གྱུར་ཏེ། །
en: Encountering such an opportunity is as difficult and rare

source: དཀའ་བའི་ལས་ཀྱི་བུ་གར་ཆུད་པ་བཞིན།
en: As the example that involves surfacing through a hole.

source: །ལུས་དང་ངག་ནི་ཤིན་ཏུ་བསྡམས་གྱུར་ནས། །ཞེན་པ་མེད་པའི་སེམས་ཀྱིས་བརྩོན་འགྲུས་བརྩམས། ། དགེ་བའི་བཤེས་གཉེན་དག་ལ་གཡོ་མེད་པས། །བདག་གི་ལུས་ནི་ཉེ་བར་འཚོ་བར་བྱ། །
en: “I will conduct myself with a noble mind, Taking care to control my body and speech, And apply my whole being unwaveringly In pursuit of spiritual friendship.

source: བདག་གི་སློབ་དཔོན་བླ་མ་གང་དག་དང་། །གང་དག་བདག་གི་བྱང་ཆུབ་སེམས་བསྐྱེད་པ། །བྱང་ཆུབ་དམ་པ་མཆོག་གི་ལམ་སྟོན་ལ། །སྟོན་པ་བཞིན་དུ་དགའ་བས་བསྙེན་བཀུར་བྱ། །
en: “My gurus, my teachers, are those Who bring about the arising of the mind of awakening in me. They teach the excellent way of supreme awakening, So I will serve these mentors with love.

source: རྣམ་པ་སྣ་ཚོགས་དག་གི་བྱུག་པ་དང་། །དྲི་དང་ཕྱེ་མ་རྣམ་པ་སྣ་ཚོགས་དང་། །གོས་དང་མེ་ཏོག་དག་གི་ཆུན་པོ་ཡིས། །རྐང་གཉིས་དམ་པ་ལ་ནི་མཆོད་པར་བྱ། །
en: “With various kinds of ointments, Various kinds of perfumes and powders, With piles of fabric and flowers, I will honor the best of men.

source: ཕྱོགས་བཅུ་དག་ན་སངས་རྒྱས་གང་བཞུགས་པ། །སེམས་ཅན་དོན་ལ་བརྩོན་ཞིང་དོན་དམ་གཟིགས། །
en: “To the buddhas who reside in the ten directions, Who work for sentient beings, who see the ultimate truth,

source: གསེར་གྱི་ཁ་དོག་ལྟ་བུའི་འོད་མཛེས་པ། །ཁ་དོག་མཐའ་ཡས་པ་ལ་མཆོད་པར་བྱ། །
en: Shining with golden radiance, Whose appearance is unfathomable, I will pay reverence.

source: སངས་རྒྱས་མི་ཡི་ཁ་ལོ་སྒྱུར་རྣམས་ལ། །འཇིག་རྟེན་སྤྱོད་དང་མཆོད་པ་ཆེར་བྱས་པས། །གང་གིས་བྱང་ཆུབ་སྙིང་པོར་བདག་འགྲོ་བའི། །བྱང་ཆུབ་ལམ་ནི་ཤིན་ཏུ་སྦྱངས་པར་འགྱུར། །
en: “Making a lavish offering of worldly objects To the buddhas, the charioteers of men, Will purify the path of awakening And enable me to reach the seat of awakening.

source: ཤཱ་རིའི་བུ་སེམས་བསྐྱེད་པ་བཞི་པ་འདི་བསྐྱེད་ནས། ། བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཡོངས་སུ་ཚོལ་བས་སློབ་དཔོན་ལ་རིམ་གྲོ་དང་། བསྙེན་བཀུར་བྱེད་དེ། ཐ་ན་ཆུ་བུམ་པ་གང་ཙམ་ཡང་འདུལ་ལོ། །
en: “This then, Śāriputra, is the fourth thought the bodhisatva cultivates, and so he applies himself to the cycle of teachings contained in The Collected Teachings on the Bodhisatva, honoring and serving his teacher to the extent that he would even be willing to give up his water flask.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟར་སེམས་བསྐྱེད་དེ། བདག་ཡུན་རིང་པོར་དགེ་བའི་བཤེས་གཉེན་དང་བྲལ་ཞིང་སྡིག་པའི་གྲོགས་པོས་ཟིན་པ། ལེ་ལོ་ཅན། བརྩོན་འགྲུས་ཉམས་པ། སྙོམ་ལས་ཅན། བླུན་པས། འདི་ལྟ་བུའི་ལྟ་བ་དང་། འདི་ལྟ་བུའི་འདོད་པས་སེམས་ཅན་ཐམས་ཅད་དང་། སྲོག་ཆགས་ཐམས་ཅད་ཀྱི་ཤ་གཅིག་ཏུ་སྤུངས་ཤིང་ཤ་གཅིག་ཏུ་བཅེར་ཏེ། བསོད་ནམས་མ་ཡིན་པའི་ལས་བྱེད་ཀྱང་། དེའི་གཞི་ལས་སྡིག་པ་མེད། དེའི་གཞི་ལས་སྡིག་པའི་རྣམ་པ་མེད་དོ། ། རྒྱ་མཚོའི་ཚུ་རོལ་གྱི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་སྦྱིན་པས་ཚིམ་པར་བྱས་ཀྱང་། དེའི་གཞི་ལས་བསོད་ནམས་མེད། དེའི་གཞི་ལས་བསོད་ནམས་ཀྱི་རྣམ་པ་མེད་དོ། ། རྒྱ་མཚོའི་ཕ་རོལ་གྱི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་བསད་ཅིང་གཏུབ་ཀྱང་དེའི་གཞི་ལས་སྡིག་པ་མེད། དེའི་གཞི་ལས་སྡིག་པའི་རྣམ་པ་མེད་དོ་སྙམ་པས་དེ་ལྟར་བྱས་ཀྱང་བསོད་ནམས་དང་སྡིག་པ་ཡོངས་སུ་ཤེས་པར་མ་ནུས་ཏེ། སྡིག་པའི་ལྟ་བ་བསྙེན་པ་དང་། གཏི་མུག་གི་ཟིལ་གྱིས་ནོན་པས་བདག་གིས་སྡིག་པ་མི་དགེ་བའི་ལས་མང་པོ་མངོན་པར་འདུས་བྱས་ཏེ། མི་དགེ་བའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་འདི་ལྟ་སྟེ། སེམས་ཅན་དམྱལ་བར་དམན་པ་འཇིགས་སུ་རུང་བའི་ལུས་ཐོབ་སྟེ། དེ་ལ་འདི་ལྟ་བུའི་སྦྱིན་གནས་མཉེས་པར་མ་བྱས་པས་དེས་ན་བདག་ནི་སེམས་ཅན་དམྱལ་བ་པར་གྱུར་པས་ལྕགས་ཀྱི་ཐུ་ལུམ་བསྲེགས་པ་ཟ་ཞིང་གཅིག་ཏུ་སྡུག་བསྔལ་བ་རྩུབ་པ། མི་བཟད་པ། འཚོགས་པ། འཆི་བའི་མཐར་ཁྲིད་པ་མྱོང་ཞིང་ལོ་སྟོང་ཕྲག་མང་པོའི་བར་དུ་བདེ་བའི་སྒྲ་ཡང་མི་ཐོས་ན་ལུས་ཀྱིས་ལྟ་ག་ལ་ཞིག་རེག་སྟེ། བདག་གིས་ནི་ད་ལྟར་མཉེས་པར་བྱས་པས། དགེ་བའི་ལུས་ཐོབ་ཀྱིས། སྦྱིན་གནས་རྣམས་ཀྱི་ཉེ་བར་འཚོ་བར་བྱ་ཞིང་ལུས་དང་སྲོག་ལ་མི་ལྟ་བར་སློབ་དཔོན་ལ་རིམ་གྲོ་དང་། བསྙེན་བཀུར་བྱའོ་ཞེས།
en: “Furthermore, Śāriputra, the bodhisatva cultivates the following thought: ‘For a long time I had no spiritual friends. Surrounded by evil friends, I was lazy, I had little vigor, I was idle and stupid, and I had the sort of opinions, the sort of tendencies, and the sort of convictions that led me to believe that even if one were to engage in the wicked acts of piling up the flesh of all sentient beings, and of squeezing the flesh of all living creatures together, no evil would be involved, that no evil would come from that. I believed that even if one were to give all sentient beings enough gifts to fill all the oceans, no good would be involved, that no good would come from that. I believed that even if one were to kill enough sentient beings to fill an ocean, if one were to cut up their bodies, no evil would be involved, that no evil would come from that. Because of these beliefs, I was not able to distinguish between good and evil. Relying on evil ideas and overcome by confusion, I developed many evil, unwholesome habits, and as a result of these unwholesome habits I had to endure terrible lower states of existence, such as hell. In the hell realm I was burned, I swallowed embers, and I experienced only sharp suffering, torture, and destruction, and eventually I died. For many hundreds of thousands of years I did not even hear the word pleasant, much less experience anything pleasant. In this kind of state I had no inclination to serve those who are worthy of veneration. Now that I have attained this fortunate state and my motivation is good, I will dedicate my life to those who are worthy of veneration, and I will serve the teachers with no concern for my body, my life or my honor.’

source: ཤཱ་རིའི་བུ་སེམས་བསྐྱེད་པ་ལྔ་པ་དེ་བསྐྱེད་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་ཡོངས་སུ་ཚོལ་བས་སློབ་དཔོན་ལ་རིམ་གྲོ་དང་། བསྙེན་བཀུར་བྱེད་དེ ཐ་ན་ཆུ་བུམ་པ་གང་ཙམ་ཡང་འབུལ་ལོ། །
en: “This is the fifth thought the bodhisatva cultivates, and so he applies himself to the cycle of teachings contained in The Collected Teachings on the Bodhisatva, honoring and serving his teacher to the extent that he would even be willing to give up his water flask.”

source: སྡིག་པའི་གྲོགས་པོ་བསྙེན་པ་དང་། །སྡིག་པའི་སེམས་ཀྱིས་བསླུས་པས་ན། །
en: “Spending time with evil friends, One ends up being deceived by evil thoughts.

source: སྡིག་པར་ལྟ་ལ་བསྟེན་གྱུར་ཏེ། །
en: Relying on evil views,

source: བདག་གིས་སྡིག་པའི་ལས་བྱས་སོ། །
en: One engages in evil acts.

source: རྒྱ་མཚོ་ཡི་ནི་ཚུ་རོལ་ན། ། སེམས་ཅན་གནས་པ་ཇི་སྙེད་པ། །ཟས་དང་སྐོམ་གྱིས་ཚིམ་བྱས་ཀྱང་། །བསོད་ནམས་དག་གི་འབྱུང་གནས་མེད། །
en: “ ‘No good will come From satisfying with food and drink As many beings As would fit into all the oceans.

source: རྒྱ་མཚོ་ཡི་ནི་ཕ་རོལ་ན། ། སེམས་ཅན་གནས་པ་ཇི་སྙེད་པ། །ཐམས་ཅད་བསད་ཅིང་བཅོམ་གྱུར་ཀྱང་། །སྡིག་པའི་འབྱུང་གནས་མེད་དོ་ཞེས། །
en: “ ‘No evil will come From killing and mutilating As many beings as would fill All the oceans.’
